konstantin-dzreev/bare-metal-rp2350-riscv/include/hardware/regs/trng.inc
# Description : * 1'b1 - Exists. *1'b0 - Does not exist
.equ	TRNG_RNG_VERSION_TRNG_TESTS_BYPASS_EN_RESET, 0x0
.equ	TRNG_RNG_VERSION_TRNG_TESTS_BYPASS_EN_BITS, 0x00000008
.equ	TRNG_RNG_VERSION_TRNG_TESTS_BYPASS_EN_MSB, 3
.equ	TRNG_RNG_VERSION_TRNG_TESTS_BYPASS_EN_LSB, 3
# -----------------------------------------------------------------------------
# Field       : TRNG_RNG_VERSION_AUTOCORR_EXISTS
# Description : * 1'b1 - Exists. *1'b0 - Does not exist
.equ	TRNG_RNG_VERSION_AUTOCORR_EXISTS_RESET, 0x0
.equ	TRNG_RNG_VERSION_AUTOCORR_EXISTS_BITS, 0x00000004
.equ	TRNG_RNG_VERSION_AUTOCORR_EXISTS_MSB, 2
.equ	TRNG_RNG_VERSION_AUTOCORR_EXISTS_LSB, 2
# -----------------------------------------------------------------------------
# Field       : TRNG_RNG_VERSION_CRNGT_EXISTS
# Description : * 1'b1 - Exists. *1'b0 - Does not exist
.equ	TRNG_RNG_VERSION_CRNGT_EXISTS_RESET, 0x0
.equ	TRNG_RNG_VERSION_CRNGT_EXISTS_BITS, 0x00000002
.equ	TRNG_RNG_VERSION_CRNGT_EXISTS_MSB, 1
.equ	TRNG_RNG_VERSION_CRNGT_EXISTS_LSB, 1
# -----------------------------------------------------------------------------
# Field       : TRNG_RNG_VERSION_EHR_WIDTH_192
# Description : * 1'b1 - 192-bit EHR. *1'b0 - 128-bit EHR
.equ	TRNG_RNG_VERSION_EHR_WIDTH_192_RESET, 0x0
.equ	TRNG_RNG_VERSION_EHR_WIDTH_192_BITS, 0x00000001
.equ	TRNG_RNG_VERSION_EHR_WIDTH_192_MSB, 0
.equ	TRNG_RNG_VERSION_EHR_WIDTH_192_LSB, 0
# =============================================================================
# Register    : TRNG_RNG_BIST_CNTR_0
# Description : Collected BIST results.
.equ	TRNG_RNG_BIST_CNTR_0_OFFSET, 0x000001e0
.equ	TRNG_RNG_BIST_CNTR_0_BITS, 0xffffffff
.equ	TRNG_RNG_BIST_CNTR_0_RESET, 0x00000000
# -----------------------------------------------------------------------------
# Field       : TRNG_RNG_BIST_CNTR_0_RESERVED
# Description : RESERVED
.equ	TRNG_RNG_BIST_CNTR_0_RESERVED_RESET, 0x000
.equ	TRNG_RNG_BIST_CNTR_0_RESERVED_BITS, 0xffc00000
.equ	TRNG_RNG_BIST_CNTR_0_RESERVED_MSB, 31
.equ	TRNG_RNG_BIST_CNTR_0_RESERVED_LSB, 22
# -----------------------------------------------------------------------------
# Field       : TRNG_RNG_BIST_CNTR_0_ROSC_CNTR_VAL
# Description : Reflects the results of RNG BIST counter.
.equ	TRNG_RNG_BIST_CNTR_0_ROSC_CNTR_VAL_RESET, 0x000000
.equ	TRNG_RNG_BIST_CNTR_0_ROSC_CNTR_VAL_BITS, 0x003fffff
.equ	TRNG_RNG_BIST_CNTR_0_ROSC_CNTR_VAL_MSB, 21
.equ	TRNG_RNG_BIST_CNTR_0_ROSC_CNTR_VAL_LSB, 0
# =============================================================================
# Register    : TRNG_RNG_BIST_CNTR_1
# Description : Collected BIST results.
.equ	TRNG_RNG_BIST_CNTR_1_OFFSET, 0x000001e4
.equ	TRNG_RNG_BIST_CNTR_1_BITS, 0xffffffff
.equ	TRNG_RNG_BIST_CNTR_1_RESET, 0x00000000
# -----------------------------------------------------------------------------
# Field       : TRNG_RNG_BIST_CNTR_1_RESERVED
# Description : RESERVED
.equ	TRNG_RNG_BIST_CNTR_1_RESERVED_RESET, 0x000
.equ	TRNG_RNG_BIST_CNTR_1_RESERVED_BITS, 0xffc00000
.equ	TRNG_RNG_BIST_CNTR_1_RESERVED_MSB, 31
.equ	TRNG_RNG_BIST_CNTR_1_RESERVED_LSB, 22
# -----------------------------------------------------------------------------
# Field       : TRNG_RNG_BIST_CNTR_1_ROSC_CNTR_VAL
# Description : Reflects the results of RNG BIST counter.
.equ	TRNG_RNG_BIST_CNTR_1_ROSC_CNTR_VAL_RESET, 0x000000
.equ	TRNG_RNG_BIST_CNTR_1_ROSC_CNTR_VAL_BITS, 0x003fffff
.equ	TRNG_RNG_BIST_CNTR_1_ROSC_CNTR_VAL_MSB, 21
.equ	TRNG_RNG_BIST_CNTR_1_ROSC_CNTR_VAL_LSB, 0
# =============================================================================
# Register    : TRNG_RNG_BIST_CNTR_2
# Description : Collected BIST results.
.equ	TRNG_RNG_BIST_CNTR_2_OFFSET, 0x000001e8
.equ	TRNG_RNG_BIST_CNTR_2_BITS, 0xffffffff
.equ	TRNG_RNG_BIST_CNTR_2_RESET, 0x00000000
# -----------------------------------------------------------------------------
# Field       : TRNG_RNG_BIST_CNTR_2_RESERVED
# Description : RESERVED
.equ	TRNG_RNG_BIST_CNTR_2_RESERVED_RESET, 0x000
.equ	TRNG_RNG_BIST_CNTR_2_RESERVED_BITS, 0xffc00000
.equ	TRNG_RNG_BIST_CNTR_2_RESERVED_MSB, 31
.equ	TRNG_RNG_BIST_CNTR_2_RESERVED_LSB, 22
# -----------------------------------------------------------------------------
# Field       : TRNG_RNG_BIST_CNTR_2_ROSC_CNTR_VAL
# Description : Reflects the results of RNG BIST counter.
.equ	TRNG_RNG_BIST_CNTR_2_ROSC_CNTR_VAL_RESET, 0x000000
.equ	TRNG_RNG_BIST_CNTR_2_ROSC_CNTR_VAL_BITS, 0x003fffff
.equ	TRNG_RNG_BIST_CNTR_2_ROSC_CNTR_VAL_MSB, 21
.equ	TRNG_RNG_BIST_CNTR_2_ROSC_CNTR_VAL_LSB, 0
# =============================================================================
.endif # _HARDWARE_REGS_TRNG_H
